Revit 2025 API
YZJustificationOption Enumeration
 The option for whether a framing element has independent or uniform justification on its ends.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum YZJustificationOption
Public Enumeration YZJustificationOption
public enum class YZJustificationOption
type YZJustificationOption
Members
Member name | Value | Description
Uniform | 0 |  Uniform justification settings applied to the element ends.
Independent | 1 |  Independent justification settings applied to the element ends.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace